#Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |
leter = input("Введите трехзначное число: ")
a = int(leter[0])
b = int(leter[1])
c = int(leter[2])
print(f"сумма цифр трехзначного числа равна {a+b+c}")
